new_list = [33, "Python", 28 , [], "", 444]
if new_list == []:
    print(new_list)
    exit()

elif len(new_list) <= 1:
    print(new_list)
    exit()

else:
    c = new_list.pop()
    new_list[0] = c

print (new_list)

# if можно записать как if not new_list: это означает если список пустой то по условием это True и print печатает пере-
# менную то что в ней записано к чему она равняется(=) и по PEP 8 это лучше
# if new_list == []: это проще для понимания, означает пустой ли наш список, если да то это True, печатается все что в
# переменной и exit() выходит с программы
# elif len(new_list) <= 1: это len(new_list) проверяет длину нашего списка и если там 1 элемент условие выполняется <= 1
# то эту True пишется print и exit() выходит из программы
# Если наши if и elif False то дальше программа через метод .pop() вырезает последний элемент и пресваевает его новой
# переменной, а new_list[0] = c озночает вместо индекса 0 который явлется элементом 1 запиши значение переменной с
