a = input("Введите ваше число(первое): ")
if not a.isdigit():
    print("Вам нужно ввести только цифры, буквы это некорректный ввод ")
    exit()
a = int(a)

b = input("Введите знак для вычисления: ")
if b not in ("+" , "-" , "*" , "/"):
     print("Вам нужно ввести что-то из этого +, -, *, /")
     exit()

c = input("Введите ваше число(второе): ")
if not c.isdigit():
    print("Вам нужно ввести только цифры, буквы это некорректный ввод ")
    exit()
c = int(c)

if  b == "+":
    print("Результат добавления: ", a + c )
elif b == "-":
    print("Результат отнимания: ", a - c)
elif b == "*":
    print("Результат умножения: ", a * c)

elif c == 0 and b == "/":
    print("Если введете 0 будет ошибка")
    exit()
