list_1 = [2, 222, 224, "New", (), [], 0]

a = len(list_1) // 2

if len(list_1) % 2:
    a += 1

list_2 = list_1[0:a]
list_3 = list_1[a:]

list_4 = [list_2, list_3]

print(list_4)

# list_1 = [2, 222, 224, "New", (), [], 0] это наш список
# a = len(list_1) // 2 с помощью len() мы находим длину списка, а с помошью // 2(ровно без остатка) мы находим средину-
# списка - Это делается для условия "розділяти один список на два", а с помощью a = len(list_1) // 2 мы примерно
# делим список на два списка, примерно по середине
# if len(list_1) % 2: мы как-будто делим количество элементов на 2 и по остатку понимаем парное(если нет остатка после
# запятой) или непарное(если есть остаток после комы)
# a += 1 - это a += 1 у нас по условию задачи сказано "Якщо в початковому списку непарна кількість елементів, то в
# першому списку має бути більше елементів". А у нас len(list_1) % 2 показало что елементов изначально непарное
# поэтому if - True и нашему списку а = 3 элемента доабвляется еще 1 элемент(a += 1)
# list_2 = list_1[0:a] - делает новый список от 0 до нового списка переменной а
# list_3 = list_1[a:] - это второй список начинается с 4 индекса и до конца списка list_1
# Когда список пустой:
# Если б list_1 был пустым то a = len(list_1) // 2 то а = 0, if len(list_1) % 2: это False
# list_2 = list_1[0:a] где а = 0 это будет []
# list_3 = list_1[a:] где а 0 то будет 0: будет []
# list_4 = [[], []]