import random

my_list = []

for i in range(random.randint(3, 10)):
    my_list.append(random.randint(1, 99))

new_list = [my_list[0], my_list[2], my_list[-2]]

print(my_list)
print(new_list)

# import random - импортирует библиотеку, что б мы получили random.randint(), где random это модуль,
# .randint()- это функция модуля random
# my_list = [] - пустой список, куда будут добавлться рандомные числа - элементы
# random.randint(3, 10) - выбирает число от 3 до 10 - которое будет нашим количеством элементов в списке
# функция range() - задает столько циклов под число, которое выпало с random.randint(3, 10)
# i - в i поочереди запишеться то количество элементов, сколько выпало с random.randint(3, 10). Если выпало 7 с
# random.randint(3, 10) то и получим 7 элементов
# my_list.append(random.randint(1, 99)) - выбирает случайное число от 1 до 99, а метод .append() добавляет числа в
# список, но количество добавлених элементов будет равняться числу что выпало с random.randint(3, 10)
# new_list = [my_list[0], my_list[2], my_list[-2]] - все числа что были входе циклов добавлены в переменную my_list из
# них выбираеться нужные нам элементы по нужным нам индексам и запишуться в новый список new_list
# print(my_list) - выдаст список всех элементов входе всех циклов
# print(new_list) - выдаст список нужных нам элементов по нужным нам индексам