number = int(input("Введите число: "))

while number > 9:
    result = 1

    while number > 0:
        last_digit = number % 10
        result *= last_digit
        number //= 10

    number = result

print(number)

# СТРОКА 1
# number = int(input("Введите число: ")) - человек вводит число через input, а int делает из числа(которое текст) де -
# лает обычное число и целое(без числа , float) К примеру из "777,2" из числа текст делает обычное число и уберает все
# числа после запятой и получаем целое число 777
# СТРОКА 2
# while number > 9: - Это цикл условие, если человек ввел в input число оно сразу приравниваеться в переменную number
# если это число меньше или равно 9 то цикл НЕ работает, а сразу печатает print(number), сразу выдает число что ввел
# человек. А если число что ввел человек больше 9(>9) то это True и мы переходим к второму циклу к второму while
# СТРОКА 3
# result = 1 - переменная в котором мы записуем цифру каждого числа и перемножаем, эта сумма сохроняеться для промежу-
# точного числа, когда все умножения заканчивается и циклы с этим числом, то мы эту сумму переменной result приравни-
# ваем к переменной number, получаем number = result и запускаеться новый цикл с новым числом
# если этот number прошел условие while number > 9: то запускаеться второй цикл и result уже для новго числа будет
# result = 1, а если б result = 0 то у нас перемножения всех числе было бы НЕ корректное всегда был бы 0
# СТРОКА 4
# while number > 0: - это второй цикл нужен для того что бы цикл повторялся пока number больше нуля. Когда number ра-
# вен 0, второй цикл закрывается. Откуда береться 0??? Из строки number //= 10, к примеру number = 4 // 10 поэтому
# number = 0. А преведущий результат преведущих цифр этого числа, который уже перемножился и записался в result,
# подставляеться опять number = result, если number > 9 то условие while number > 9 срабатывает и заново открываеться
# второй цикл, а когда number > 9 если number меньше 9 к примеру 8 то оба цикла уже не работают
# СТРОКА 5
# last_digit = number % 10 - мы наше число, которое в переменной number делим на 10 и находим % остаток от числа это
# будет первая цифра(ее значение) после запятой. Пример: 423 % 10 = 42,3 % и наш остаток от деления будет 3 и переменная
# last_digit = 3
# СТРОКА 6
# result *= last_digit - наш result = 1 *(умножаем) на значение переменной last_digit. К примеру result = 1, а
# last_digit = 3 то будет result *= last_digit - это result = 1 * 3  получаем = 3
# СТРОКА 7
# number //= 10 - убераем после деления все что после запятой, получаем number = целое число . Пример 42 // 10 = 4,2
# Но с // будет целое число 4
# СТРОКА 8
# number = result - наш второй цикл разобрал цифры из числа, перемножид их и получил сумму всех умножених чисел в
# переменной result. И мы приравниваем эту сумму к переменной number, получаем number = result если в итоге number
# больше 9 то срабатыват условие while number > 9 и снова работает второй цикл. Если сумма в result меньше 9 и эту
# сумму мы передали в number то number меньше 9 и условие while number > 9 становиться False
# СТРОКА 9
# print(number) - выводит это число что в number. И второй вариант, если изначально человек ввел в input написал число
# меньше 9 то это приравнялось в number и print вывел это
