new_list = [33, "Python", 28 , [], "", 444]
if new_list == []:
    print(new_list)
    exit()

elif len(new_list) == 1:
    print(new_list)
    exit()

else:
    c = new_list.pop()
    new_list.insert(0,c)


print (new_list)

# if можно записать как if not new_list: это означает если список пустой то по условием это True и print печатает пере-
# менную то что в ней записано к чему она равняется(=) и по PEP 8 это лучше
# if new_list == []: это проще для понимания, означает пустой ли наш список, если да то это True, печатается все что в
# переменной и exit() выходит с программы
# elif len(new_list) == 1: это len(new_list) проверяет длину нашего списка и если там 1 элемент условие выполняется == 1
# то это True пишется print и exit() выходит из программы
# Если наши if и elif - False то срабатывает else, программа через метод .pop() вырезает последний элемент и присваевает
# его новой переменной c , new_list.insert(0,c) означает в наш список new_list с помощью метода .insert() вставь на
# место старого первого элемента, вставь новый элемент переменной c , а старый первый элемент просто посуниться
# !!!если сделать в начале if len(new_list) <= 1: то у нас сразу будет и проверятся и пустой список и когда 1 елемент!!!
# и тогда мы можем обьеденить и if и elif в одно условие
# если список пустой то это 0 меньше 1 и это True пишется print нашей переменной и exit()
# если список из 1 элеиента меньше или равнется 1 то это True и пишется print нашей переменной и exit()!!!
