code = [1, 22, 7, 3.14, 22, 30]
index = 0
result = 0

if not code:
    print(result)

else:
    while index < len(code):
      result += code[index]
      index += 2

    result = result * code[-1]
    print(result)

# code = [1, 22, 7, 3.14, 22, 30] - наш список, который мы придумали
# index = 0 - переменная которая пока что равняется 0, дальше эта переменная будет использоваться как индекс
# result = 0 - переменная куда будут записываться элементы или с условия if или с условия else
# if not code: - мы говорим если наш список пустой то это True и распечатай print(result) переменную result, а она = 0
# else - если наш список НЕ пустой то это False и срабатывает else
# while index < len(code): проверяет что б наша переменная index(которая далее будет индексом) была меньше количества
# всех элементов, потому что индекс должен быть на 1(счет) меньше последнего элемента
# result += code[index] - подусловие находиться в while и в переменую result записывается элемент нулевого индекса, по-
# мучто сначла начинаем с индекса 0, а дальше в code[index] будут подставлятся индексы и элементы, которые  мы укажем
# index += 2 - делаем что б индекс в конце каждого цикла увеличивался на 2 - по условиям задачи нам нужны элементы
# парных индексов
# result = result * code[-1] - НЕ в while, а на одном уровне с while что бы после всех нужных нам циклов их сумма эле -
# ментов по условиям задачи умножалась на последний элемент списка
# А code[-1] - по индексу -1 это всегда послдений элемент списка
# print(result) - НЕ в цикле while, а на одном с ним уровне, являэться подусловием else

