list_1 = [0, 0, 0, 1, 12, 27, 99, 100]

list_3 = []
list_2 = []

for i in list_1:
    if i > 0:
        list_2.append(i)


    else:
     list_3.append(i)



list_4 = list_2 + list_3
print(list_4)

# у нас есть список list_1 = [0, 0, 0, 1, 12, 27, 99, 100]
# list_2 = [] и list_3 = [] мы создали переменные и указали что они списки
# for i in list_1: - мы говорим возбми каждый элемент с list_1 и подставь его в i - новую переменную ящик куда
# поочереди подставляються элементы
# if i > 0: - если элемент, который чейчас находиться в i больше 0 то это True, выполняется след. подусловие
# list_2.append(i) - в нашу переменную list_2 = [], которая список с помощью метода .append() записуються все элементы,
# которые были в i и по условиям эти элементы больше 0  --- if i > 0
# else: list_3.append(i) - все элементы, которые НЕ подходят под условие if i > 0 это False срабатывает else, значит
# элементы меньше 0 и их добавь в list_3 список
# list_4 = list_2 + list_3 - мы создали новую переменную list_4, куда буду добавлятся эти списки
# Нули в конце списка list_4 потому что мы их подставили в list_3 - а ее добавили второй к list_2
