a = input("Введите ваше число(первое): ")
if not a.isdigit():
    print("Вам нужно ввести только цифры, буквы это некорректный ввод ")
    exit()
a = int(a)

b = input("Введите знак для вычисления: ")
if b not in ("+" , "-" , "*" , "/"):
     print("Вам нужно ввести что-то из этого +, -, *, /")
     exit()

c = input("Введите ваше число(второе): ")
if not c.isdigit():
    print("Вам нужно ввести только цифры, буквы это некорректный ввод ")
    exit()
c = int(c)

if  b == "+":
    print("Результат добавления: ", a + c )
elif b == "-":
    print("Результат отнимания: ", a - c)
elif b == "*":
    print("Результат умножения: ", a * c)

elif c != 0 and b == "/":
    print("Результат деления: ", a / c)
else:
    print("Если введете 0 будет ошибка")

# 1) Разбор кода:

# 2.1) Разбор переменной a и c:
# Разбор конструкции if not a.isdigit() + print + exit() + переменные в int:
# Если перед if not a.isdigit(): вводить a или c = int(input("Введите ваше число(первое): ")) то будет конфликт
# Потому что для проверки not a.isdigit() ожидает строку, буквы но НЕ цифры, a или c = int(input()) - сразу привод.Цифры
# Если наш not a.isdigit() видит буквы для него это True и выполняются следующие условия постепенно:
# Первое условие: наш print в if, а потом сразу выполняется второе подусловие: exit()
# За счет exit() программа не падает, а останавливается, если б его НЕ было то наши буквы:
# Приравнивались бы к переменной,которая уже в int и выдается ошибка програма падает, потому что int ждет цифры НЕ буквы
# Таким образом если человек пишет буквы, знаки НЕ цифры то ему выдается сообщение - предупреждение наш print
# Если человек пишет правильно, пишет цифры то они будут восприниматься как "цифры - текст"
# и потом они приравниются к нашей переменной, а переменная = int(переменная)

# 2.2) Разбор переменной b:
# b = input("Введите знак для вычисления: ") - b это у нас только input не int, потому что b это знаки (+, -, *, /)
# А в int только цифры записываются, а знаки это НЕ цифры поэтому был бы конфликт, нужно писать b через input
# Тут if b not in ("+" , "-" , "*" , "/"): мы указываем что b может включать только заданные нами данные
# А вот not in говорит что если человек пишет не заданные нами данные то это будет ошибка для человека
# А у нас в коде not in становится True и выполн. условия: подсказка - print что нужно ввести и exit() - закрытие кода

# 3) Разбор вычисление математики кода:

# 3.1) Разбор условий b:
# В нашем коде нет разницы как писать условия все через if или один if и остальное через elif результат будет один:
# потому что для каждого условия свой математический знак и операция будет выполнятся одна
# В первых трех вычислениях мы пишем: b == "знак" --- Так мы спрашиваем равняется ли наше b == этому знаку???
# Если програма видет что человек написал знак и b равняется этому знаку то мы говорим программе:
# напиши print - выдай нам вычисление посчитай наше a и c

# 3.2) Разбор условий деление на 0:
# elif c != 0 and b == "/": Наш elif говорит условие:
# Если c НЕ равно 0 и у нас деление то это True, выполни вычисление a / c и print пишет нам решение
# А если c = 0 то условие elif не выполняется и это False выдается наш else сообщение предупреждение
# *** Альтернативное решение - условие***
# Если мы в elif укажем условие: с == 0 and b == "/": Тогда если с = 0 это True тогда нужно сделать предупреждение
# print("Если введете 0 будет ошибка") и сразу второе подусловие exit() так наша програма останавливается и нет падения
# хотя в нашем случае exit() - не обязательно писать, тут падение не будет потому что после exit() нет больше кода