
seconds = int(input("Введите секунды: "))

days = seconds // 86400
seconds = seconds % 86400

hours = seconds // 3600
seconds = seconds % 3600

minutes = seconds // 60
seconds = seconds % 60

if days == 1:
    day_word = "день"
elif days in (2, 3, 4):
    day_word = "дні"
else:
    day_word = "днів"

print(f"{days} {day_word}, {str(hours).zfill(2)}:{str(minutes).zfill(2)}:{str(seconds).zfill(2)}")


# seconds = int(input("Введите секунды: ")) - человек ввел число оно стало целым(int) и теперь переменная seconds рав-
# няется этому числу
# days = seconds // 86400 - мы делим то число что написал человек и чему теперь равна переменная секунды - seconds де-
# лим на 86400 - это количество секунд в сутках. Мы найдем количество дней, если секунд(seconds) меньше чем количество
# секунд в одном дне. У нас количество дней 0, поэтому days 0
# seconds = seconds % 86400 - мы оставляем остаток секунд, после того как убрали полные дни, наши секунды seconds от них
#  % берем секунды в сутках 86400, находим сколько секунд в дне
# hours = seconds // 3600 - в одном часе 3600 секунд, мы наши секунды делим(Ровно) на количество секунд в одном часе и
# получаем сколько часов у нас осталось
# seconds = seconds % 3600 - мы находим остаток секунд которые не поместились в часы
# minutes = seconds // 60 - мы наши секунды делим на количество секунд в одной минуте и находим количество полных минут
# seconds = seconds % 60 - находим остаток секунд, которые не поместились в наши минуты
# if days == 1: - это условие приравнивания день к одному "день". Дальше срабатывает подусловие  day_word = "день" -
# если количество секунд после всех вычеслений ровно уложилось в один день это пишеться в ответе: один день( 1 день) и
# столькато часов,минут, секунд
# day_word = "день" сохраняем слово "день" в переменную day_word
# elif days in (2, 3, 4): - это условие если количество секунд перешло в 2,3 или 4 дня то выполняеться подусловие
# day_word = "дні" - к примеру в seconds количество секунд помещаеться в 2 дня то будет писать 2 дні, столькато мин,час.
# else: day_word = "днів" - если в переменной days у нас количество дней НЕ 1, не 2, не 3, не 4 тогда у гас выпол-
#няеться else и будет выполняться подусловие днів
# print(f"{days} {day_word}, {str(hours).zfill(2)}:{str(minutes).zfill(2)}:{str(seconds).zfill(2)}") - print выводит
# в терминал, f это ф строки позволяет подставлять значения переменных внутырь текста, {days} - это переменная куда
# записуеться число переменной days, {day_word} - подставляет значение переменной от того какие условия сработали,
# str(hours) - число что в переменной hours переводиться в строку, потому что метод zfill() работает только со строками
# Таким образом str(hours).zfill(2) - переводит число что в переменной hours в строку, а .zfill(2) - добавляет ноль
# в начало строки, если в ней меньше двух символов, так само с str(minutes).zfill(2) и str(seconds).zfill(2)
# : - это разделитель между часами, минутами и секундами