number = int(input("Введіть число: "))

while number > 9:
    result = 1
    for digit in str(number):
        result *= int(digit)
    number = result

print(number)

# СТРОКА 1
# number = int(input("Введіть число: ")) - человек ввел число с помощью input, а int делает число целым, если человек
# ввел 555,2 то int откинет число после комы и даст целое число( в задаче в условиях работа с целыми числами)
# СТРОКА 2
# while number > 9:, цикл умови while будет работать пока наше число в number больше 9, если число меньше или равняется
# 9 ир цикл работать НЕ будет
# СТРОКА 3
# result = 1 — перед началом перемножения цифр нового числа мы задаём переменной result значение 1.
# Цикл for берёт каждую цифру числа по очереди, перемножает их, и result сохраняет промежуточный результат
# каждого умножения. Когда все цифры перемножены, полученное значение записывается в number.
# Если number всё ещё больше 9, процесс повторяется, и перед новым перемножением result снова получает значение 1
# Если б result = 0 то НЕ получили бы правильный результат умножения всех цифр числа,
# потому что при умножении на 0 результат всегда будет равен 0. Поэтому начинаем с 1.
# СТРОКА 4
# for digit in str(number): - человек ввел число оно записалось в number что бы програма прошла по каждой цифре отдельно
# то мы превращаем число в текст. К примеру: число 729 превратили в текст и теперь можем каждое число подставлять в
# digit, будет digit = "7", digit = "2", digit = "9"
# СТРОКА 5
# result *= int(digit) - наш int(digit) превращает текущую цифру из текста в число и умножаем на значение пере-
# менной result. Пример: взяли "7" через int(digit) сделали 7 умножили на 1(значение result) стало result = 7.
# Взяли "2" через int(digit)сделали число 2 умножили на 7, result = 14
# Взяли "9" через int(digit)сделали число 9, 9 умножили на 14(значение result) получили result = 126. В пределах одного
# числа result у нас постоянно меняеться, допустим человек ввел 729  и в цикле 729 result НЕ постоянно 1, а он увеличи
# ваеться, меняется. То есть result меняеться после каждой цифры, которую обрабатывает for
# СТРОКА 6
# number = result - после цикла for, когда мы разбили наше число на каждую цифру и записали, перемножили эти цифры
# между собой, у нас появляется result - сумма всех умноженых цифр нашего числа, теперь в конце наш
# result = равен новому значению, а number = result, number имеет теперь такое же значение как и в result, теперь
# этот number мы подставляем в строку while number > 9  и если наш number больше 9 то мы переходим в цикл for
# и так по кругу до тех пор пока в цикле for наш result > 9, наш result переходит в значение в number, теперь
# number = result и смотрим на строчку while number > 9, если наш новый number меньше или тоже равен 9 то
# цикл НЕ работает
# print(number) - как только number станет меньше или равен 9 то print(number) выведит этот number



