import string

name = input("Введите слово: ")
name = name.split("-")
letters = string.ascii_letters
name[0] = letters.index(name[0])
name[1] = letters.index(name[1])
result = letters[name[0]:name[1] + 1]
print(result)

# import string- подключаем библиотеку string что б мы могли использовать string.ascii_letters - с помощью этого полу-
# чаем диапазон английських букв маленькх и больших . Затем мы используем этот диапазон что бы находить индексы букв
# name[0] и name[1]
# name = name.split("-") - метод name.split("-") разделяет нашу строку по тире и делает список, name = список элементов
# name[0] - это буквы или буква, которые были до тире это первый элемент списка, name[1] - это буквы или буква что бы
# после тире они находились во втором элементе списка. name[0] и name[1] могут содержать одну или несколько букв
# как маленькие так и большие. Главное что бы буквы внутри каждого элемента name[0] и name[1] шли в том же порядке что
# и в диапазоне letters, если порядок из нескольки букв другой не как в letters то код падает, а между name[0] и name[1]
# может быть любой диапазон букв
# letters = string.ascii_letters - переменная letters содержит диапазон английських букв из модуля string сначала ма-
# ленькие a - z , потом большие A - Z
# name[0] = letters.index(name[0]) - наше name[0] это первый елемент нашего списка в котором одна или несколько букв,
# letters.index(name[0]) - ищем буквы name[0] в диапазоне letters и получаем индекс числа первой буквы найденной после-
# довательности то есть буквы с которой начинаеться name[0], затем присваиваем это число(индекс) в name[0]
# name[1] - это второй элемент списка находиться так же как и name[0]
# result = letters[name[0]:name[1] + 1] - в result записываеться срез диапазон букв переменной letters,
# name[0] - число, которое мы получаем из диапазона letters для первой буквы первого элемента списка name,
# name[1] - число, которое мы получаем из диапазона letters для первой буквы второго элемента списка name
# + 1 - добавляем единицу что бы последняя буква тоже вошла в срез(Включительно) , result - переменная в которую
# записываеться срез диапазона letters
# print(result) - выводит диапазон среза