my_list = [0, 1, 7, 2, 4, 8]

result = 0

for i in range(0, len(my_list), 2):
    result += my_list[i]

if my_list:
    result *= my_list[-1]
else:
    result = 0

print(result)

# my_list = [0, 1, 7, 2, 4, 8] - наш список
# result = 0 - переменная куда будут записываться поочереди элементы и сразу добавляться между собой
# for i in range(0, len(my_list), 2): - for это цикл перебора последовательно всех элементов списка
# В i будут подставляться только парные индексы из-за условия range(0, len(my_list), 2):
# in - означает что i получит значение из range(0, len(my_list), 2):
# range(0, len(my_list), 2):  - означает range функция, 0 - мы указываем что бы range начал перебирать элементы с
# нулевого мндекса, len(my_list) - наша длина списка(количество элементов), 2 - это шаг 2, указываем перебери все эле-
# менты через 2
# result += my_list[i] - вместо my_list[i] беерться элемент нашего индекса, который сейчас перебераеться в цикле и
# добаляеться к результату переменной result
# if my_list: - если списко НЕ пустой то это True и выполняеться подусловие
# result *= my_list[-1] - переменную result(ранее где была сумма всех нужны нам элементов) умножаем на последний
# элемент списка
# else: result = 0 - если наш список пустой то if это False и выполняеться else и наш result = 0, как изначально
# print(result) - выводит результат или if или else это зависит от того пустой ли список(else) или НЕ пустой(if)